<?php

return [
    // Форма обратной связи
    'titleForm' => 'Контакты',
    'name' => 'Имя',
    'email' => 'Адрес электронной почты',
    'subject' => 'Тема',
    'body' => 'Сообщение',
    'verifyCode' => 'Проверочный код',
    'send' => 'Отправить',
    'successFormMessage' => 'Благодарим Вас за обращение к нам. Мы ответим Вам как можно скорее.',
    'debuggerFormMessage' => 'Обратите внимание, что если вы включите отладчик Yii, вы сможете просмотреть почтовое сообщение на панели электронной почты отладчика.',
    'notSentFormMessage' => '
Поскольку приложение находится в режиме разработки, сообщение не отправляется, а сохраняется как
файл под <code>{code}</code>. Пожалуйста настройте <code>useFileTransport</code> свойство в <code>mail</code>
компонента приложения, чтобы включить отправку электронной почты.',
    'helloFormMessage' => 'Если у вас есть деловые или любые другие вопросы, пожалуйста, заполните следующую форму, чтобы связаться с нами. Спасибо!',

    // Общее
    'save' => 'Сохранить',
    'update' => 'Обновить',
];